Revit 2025 API
BendingDetailSegmentLengthsDisplayOptions Enumeration
 Describes if the segment lengths are represented using dimensions or just as text.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BendingDetailSegmentLengthsDisplayOptions
Public Enumeration BendingDetailSegmentLengthsDisplayOptions
public enum class BendingDetailSegmentLengthsDisplayOptions
type BendingDetailSegmentLengthsDisplayOptions
Members
Member name | Value | Description
Text | 0 |  Display as texts
Dimension | 1 |  Display as dimensions
See Also
Reference
Autodesk.Revit.DB.Structure Namespace